import moment from 'moment';

export const MENU = [{
	key: 'BRIEF',
	title: '活动简介',
	uri: '/brief',
}, {
	key: 'TIMELINE',
	title: '时间安排',
	uri: '/timeline',
}, {
	key: 'ROOM',
	title: '房间安排',
	uri: '/room',
}, {
	key: 'TEAM',
	title: '人员分组',
	uri: '/team',
}, {
	key: 'ACTIVITY',
	title: '大巴活动',
	uri: '/activity',
}];

export const TIMELINE = [{
	start: moment('2019-07-26 13:30'),
	end: moment('2019-07-26 18:30'),
	text: '乘坐大巴前往目的地（车上团建小活动）',
}, {
	start: moment('2019-07-26 19:00'),
	end: moment('2019-07-26 24:00'),
	text: '晚饭、饭后娱乐（棋牌、麻将、ktv等）',
}, {
	start: moment('2019-07-27 8:30'),
	end: moment('2019-07-27 9:00'),
	text: '早餐',
}, {
	start: moment('2019-07-27 9:10'),
	end: moment('2019-07-27 11:30'),
	text: '草原骑马、草原小游戏',
}, {
	start: moment('2019-07-27 12:00'),
	end: moment('2019-07-27 14:00'),
	text: '午餐、午休',
}, {
	start: moment('2019-07-27 14:20'),
	end: moment('2019-07-27 17:30'),
	text: '皇家鹿苑',
}, {
	start: moment('2019-07-27 18:00'),
	end: moment('2019-07-27 24:00'),
	text: '特色烤全羊，各种烧烤、啤酒、农家饭等等。饭后娱乐（棋牌、麻将、ktv等）',
}, {
	start: moment('2019-07-28 8:00'),
	end: moment('2019-07-28 9:00'),
	text: '早餐',
}, {
	start: moment('2019-07-28 9:00'),
	end: moment('2019-07-28 14:00'),
	text: '乘坐大巴返程',
}];

export const ROOM_LIST = [
	['靳黎明'],
	['姚阳', '袁强强'],
	['王军杰', '王亚群'],
	['陈永斌', '陈永斌家属'],
	['赵鹏', '高昊祯'],
	['洪波', '孙皓'],
	['李猛', '张文海'],
	['赵英博', '孙磊'],
	['杨少鹏', '顾建波'],
	['孙永侠', '姚鑫'],
	['郝强', '程明'],
	['王志超', '李硕'],
	['周喜', '吴密先'],
	['曾庆翮', '闫玉强'],
	['王忠豪', '鲁波'],
	['王一', '袁珂欣'],
	['刘璐', '吴翔'],
	['翟沁', '黄芳'],
	['孙雪苹', '张靖雯'],
];

export const TEAM_LIST = [
	['靳黎明', '刘璐', '张靖雯', '程明', '王军杰', '杨少鹏'],
	['孙永侠', '姚鑫', '王忠豪', '鲁波', '王一', '袁珂欣'],
	['高昊祯', '赵鹏', '赵英博', '孙雪苹', '翟沁', '黄芳'],
	['姚阳', '袁强强', '吴密先', '周喜', '陈永斌', '陈永斌家属'],
	['郝强', '洪波', '孙皓', '李硕', '王志超', '顾建波'],
	['李猛', '孙磊', '张文海', '曾庆翮', '闫玉强', '王亚群'],
];
